import { range } from './range';
let numbers: number[] = range(1, 10);
console.log(numbers);

// FE & BE : CS (*Computer Science)
// 실행문 & 표현식문
// JS V선언 : 의미!! => 값?!!!
// 원시타입선언 & 주소복사선언
// JS를 활용해서 코드를 작성!!
// 명령형 프로그래밍 방법으로 진행!!
// 이터러블 객체를 활용해서 해당 객체안에 담겨있는 값들을 하나씩 뽑아서 반복적인 연산작업을 해주자!!!
// for in / of문 : 명령형 프로그래밍 방법
// 장점 : 매우 습득하기 빠르다. 학습이 효율적
// 단점 : 해당 코드를 실행되지 않는다 => 이유를 하나에 열까지다 테스트 및 실험!!
// 이러한 명령형 프로그래밍을 (*로우=low level 레벨 프로그래밍 방식)
// 고품질 하이 레벨 방식으로 프로그래밍을 하려면 => 선언형 프로그래밍 방식!!
// 초심들에게는 어려운 방식 / 하지만, 익숙해지면 굉장히 효율적이고, 버그를 찾을 때 말도안될 정도의 효율성!!
// 선배 강남에서 초등학생 대상 프로그래밍 알고리즘
// 파이썬, C언어!! => 선언형 방식
// 전국 초.중.고 올림피아드 대회 (*코딩, 프로그래밍)
